pressure-test/results/wrk2/load-20260504T070109Z.txt
D:/Git/scripts/plan_list.lua: cannot open D:/Git/scripts/plan_list.lua: No such file or directory
D:/Git/scripts/plan_list.lua: cannot open D:/Git/scripts/plan_list.lua: No such file or directory
D:/Git/scripts/plan_list.lua: cannot open D:/Git/scripts/plan_list.lua: No such file or directory
[...]
Running 1m test @ http://host.docker.internal:20004
  4 threads and 64 connections
  Thread calibration: mean lat.: 2.429ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.454ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.466ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.481ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.47ms    5.01ms  85.31ms   93.39%
    Req/Sec   258.87    125.52     2.00k    73.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.11ms
 75.000%    2.94ms
 90.000%    5.96ms
 99.000%   27.28ms
 99.900%   57.53ms
 99.990%   74.11ms
 99.999%   85.38ms
100.000%   85.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.683     0.000000            1         1.00
       1.342     0.100000         4912         1.11
       1.569     0.200000         9837         1.25
       1.755     0.300000        14725         1.43
       1.927     0.400000        19644         1.67
       2.109     0.500000        24575         2.00
       2.213     0.550000        27025         2.22
       2.331     0.600000        29480         2.50
       2.477     0.650000        31918         2.86
       2.665     0.700000        34371         3.33
       2.937     0.750000        36824         4.00
       3.135     0.775000        38050         4.44
       3.395     0.800000        39272         5.00
       3.805     0.825000        40500         5.71
       4.287     0.850000        41722         6.67
       4.919     0.875000        42953         8.00
       5.383     0.887500        43565         8.89
       5.959     0.900000        44181        10.00
       6.603     0.912500        44788        11.43
       7.627     0.925000        45402        13.33
       8.863     0.937500        46016        16.00
       9.703     0.943750        46322        17.78
      10.719     0.950000        46630        20.00
      12.111     0.956250        46936        22.86
      13.319     0.962500        47242        26.67
      15.359     0.968750        47549        32.00
      16.575     0.971875        47704        35.56
      17.695     0.975000        47858        40.00
      18.991     0.978125        48009        45.71
      20.607     0.981250        48162        53.33
      22.543     0.984375        48316        64.00
      23.727     0.985938        48392        71.11
      25.135     0.987500        48469        80.00
      26.623     0.989062        48546        91.43
      28.095     0.990625        48622       106.67
      30.223     0.992188        48700       128.00
      31.599     0.992969        48737       142.22
      32.703     0.993750        48776       160.00
      33.951     0.994531        48814       182.86
      35.551     0.995313        48852       213.33
      38.111     0.996094        48891       256.00
      38.943     0.996484        48910       284.44
      40.575     0.996875        48929       320.00
      42.111     0.997266        48949       365.71
      43.519     0.997656        48968       426.67
      46.175     0.998047        48987       512.00
      47.199     0.998242        48996       568.89
      48.639     0.998437        49006       640.00
      52.415     0.998633        49015       731.43
      56.735     0.998828        49025       853.33
      57.887     0.999023        49035      1024.00
      59.391     0.999121        49039      1137.78
      61.375     0.999219        49044      1280.00
      62.207     0.999316        49049      1462.86
      62.783     0.999414        49054      1706.67
      64.895     0.999512        49059      2048.00
      65.407     0.999561        49061      2275.56
      66.559     0.999609        49063      2560.00
      68.991     0.999658        49066      2925.71
      70.079     0.999707        49068      3413.33
      70.783     0.999756        49071      4096.00
      71.743     0.999780        49072      4551.11
      72.831     0.999805        49073      5120.00
      72.959     0.999829        49074      5851.43
      73.023     0.999854        49075      6826.67
      74.111     0.999878        49077      8192.00
      74.111     0.999890        49077      9102.22
      77.119     0.999902        49078     10240.00
      77.119     0.999915        49078     11702.86
      77.503     0.999927        49079     13653.33
      77.567     0.999939        49080     16384.00
      77.567     0.999945        49080     18204.44
      77.567     0.999951        49080     20480.00
      77.567     0.999957        49080     23405.71
      82.111     0.999963        49081     27306.67
      82.111     0.999969        49081     32768.00
      82.111     0.999973        49081     36408.89
      82.111     0.999976        49081     40960.00
      82.111     0.999979        49081     46811.43
      85.375     0.999982        49082     54613.33
      85.375     1.000000        49082          inf
#[Mean    =        3.473, StdDeviation   =        5.007]
#[Max     =       85.312, Total count    =        49082]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59158 requests in 1.00m, 32.00MB read
  Socket errors: connect 0, read 0, write 0, timeout 18
  Non-2xx or 3xx responses: 59158
Requests/sec:    985.90
Transfer/sec:    546.08KB