pressure-test/results/wrk2/load-20260504T070409Z.txt
D:/Git/scripts/plan_list.lua: cannot open D:/Git/scripts/plan_list.lua: No such file or directory
D:/Git/scripts/plan_list.lua: cannot open D:/Git/scripts/plan_list.lua: No such file or directory
D:/Git/scripts/plan_list.lua: cannot open D:/Git/scripts/plan_list.lua: No such file or directory
[...]
Running 1m test @ http://host.docker.internal:20004
  4 threads and 64 connections
  Thread calibration: mean lat.: 2.163ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.106ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.140ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.094ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.13ms    2.44ms  55.10ms   93.55%
    Req/Sec   194.44    112.66     1.67k    76.12%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.61ms
 75.000%    2.03ms
 90.000%    3.09ms
 99.000%   12.54ms
 99.900%   30.50ms
 99.990%   51.20ms
 99.999%   55.13ms
100.000%   55.13ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.550     0.000000            1         1.00
       1.001     0.100000         3675         1.11
       1.185     0.200000         7338         1.25
       1.339     0.300000        11007         1.43
       1.475     0.400000        14665         1.67
       1.608     0.500000        18325         2.00
       1.674     0.550000        20167         2.22
       1.742     0.600000        22000         2.50
       1.820     0.650000        23839         2.86
       1.916     0.700000        25662         3.33
       2.028     0.750000        27497         4.00
       2.089     0.775000        28423         4.44
       2.157     0.800000        29316         5.00
       2.249     0.825000        30232         5.71
       2.381     0.850000        31150         6.67
       2.589     0.875000        32059         8.00
       2.769     0.887500        32518         8.89
       3.085     0.900000        32975        10.00
       3.513     0.912500        33434        11.43
       4.059     0.925000        33891        13.33
       4.683     0.937500        34350        16.00
       5.067     0.943750        34578        17.78
       5.439     0.950000        34808        20.00
       5.955     0.956250        35036        22.86
       6.423     0.962500        35265        26.67
       7.107     0.968750        35494        32.00
       7.519     0.971875        35608        35.56
       8.023     0.975000        35723        40.00
       8.567     0.978125        35837        45.71
       9.151     0.981250        35952        53.33
       9.983     0.984375        36066        64.00
      10.519     0.985938        36123        71.11
      11.239     0.987500        36181        80.00
      12.023     0.989062        36240        91.43
      13.039     0.990625        36295       106.67
      14.255     0.992188        36352       128.00
      14.911     0.992969        36381       142.22
      15.615     0.993750        36410       160.00
      16.159     0.994531        36438       182.86
      17.055     0.995313        36467       213.33
      18.751     0.996094        36495       256.00
      19.423     0.996484        36510       284.44
      20.271     0.996875        36525       320.00
      20.895     0.997266        36538       365.71
      21.423     0.997656        36553       426.67
      22.783     0.998047        36567       512.00
      24.527     0.998242        36574       568.89
      25.903     0.998437        36581       640.00
      27.071     0.998633        36588       731.43
      30.031     0.998828        36596       853.33
      31.039     0.999023        36603      1024.00
      32.239     0.999121        36606      1137.78
      33.503     0.999219        36610      1280.00
      36.703     0.999316        36613      1462.86
      40.319     0.999414        36617      1706.67
      42.143     0.999512        36621      2048.00
      42.335     0.999561        36622      2275.56
      43.487     0.999609        36624      2560.00
      45.855     0.999658        36626      2925.71
      46.463     0.999707        36628      3413.33
      47.839     0.999756        36630      4096.00
      47.839     0.999780        36630      4551.11
      47.903     0.999805        36631      5120.00
      48.191     0.999829        36632      5851.43
      50.559     0.999854        36633      6826.67
      51.199     0.999878        36634      8192.00
      51.199     0.999890        36634      9102.22
      51.295     0.999902        36635     10240.00
      51.295     0.999915        36635     11702.86
      51.423     0.999927        36636     13653.33
      51.423     0.999939        36636     16384.00
      51.423     0.999945        36636     18204.44
      54.239     0.999951        36637     20480.00
      54.239     0.999957        36637     23405.71
      54.239     0.999963        36637     27306.67
      54.239     0.999969        36637     32768.00
      54.239     0.999973        36637     36408.89
      55.135     0.999976        36638     40960.00
      55.135     1.000000        36638          inf
#[Mean    =        2.129, StdDeviation   =        2.444]
#[Max     =       55.104, Total count    =        36638]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  46716 requests in 1.00m, 25.27MB read
  Socket errors: connect 0, read 0, write 0, timeout 385
  Non-2xx or 3xx responses: 46716
Requests/sec:    778.47
Transfer/sec:    431.19KB